## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 3 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cartography_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cartography_policies"  {
      ~ id      = "3564111915" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::957818836222:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::946524763117:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::886481071419:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::871282759583:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::866996500832:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::862524432354:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::847097524271:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::843973686572:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806721586252:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806545929748:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::796730610681:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::794722365809:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::774443804833:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::773858180673:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::762579868088:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::729164266357:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::692499439251:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::687401027353:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::659087519042:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::639515743091:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::637287734259:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::571510889204:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::563894450011:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::507252742351:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::493890668711:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472286471787:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472285538301:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::419291849580:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::414662622316:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::373750682134:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::339850311124:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::296255494825:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::283582579564:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::276192857112:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::274536870005:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::239043911459:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::236007890657:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::226270273618:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::154232573588:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::137554749751:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::132761243856:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::131154131660:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::127893201980:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::124044056575:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::067823670710:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::034163289675:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::026142063939:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::017790921725:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::009883649233:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::008792007042:role/secopsAssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:Describe*"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/shared_key",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/customer_id",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.neo4j_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "neo4j_container_definition"  {
      ~ id       = "449dba73a5c898a874f598cd40db49f7bf4ebf02228ba272196ac1bae0448df8" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "NEO4J_dbms_memory_pagecache_size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_dbms.memory.heap.initial_size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_dbms_memory_heap_max__size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_ACCEPT_LICENSE_AGREEMENT"
                          - value = "yes"
                        },
                    ]
                  - essential        = true
                  - image            = "neo4j:4.4.10@sha256:8e3dabe4b3d21c3ffa94dac6750c748b29f93b38d24182c3609ee0cbf293d4cf"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/neo4j"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "neo4j-task"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/var/lib/neo4j/data"
                          - readOnly      = false
                          - sourceVolume  = "neo4j-efs-volume"
                        },
                    ]
                  - name             = "neo4j"
                  - portMappings     = [
                      - {
                          - ContainerPort = 7474
                          - Protocol      = "tcp"
                          - hostPort      = 7474
                        },
                      - {
                          - ContainerPort = 7473
                          - Protocol      = "tcp"
                          - hostPort      = 7473
                        },
                      - {
                          - ContainerPort = 7687
                          - Protocol      = "tcp"
                          - hostPort      = 7687
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEO4J_AUTH"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 400000
                          - name      = "nofile"
                          - softLimit = 400000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.sfn_events_cloudquery will be created
  + resource "aws_cloudwatch_event_target" "sfn_events_cloudquery" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::794722365809:role/secopsAssetInventoryStateMachineRole"
      + rule           = "cloudquery"
      + target_id      = (known after apply)
    }

  # aws_ecs_service.neo4j will be updated in-place
  ~ resource "aws_ecs_service" "neo4j" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/cloud_asset_discovery/neo4j"
        name                               = "neo4j"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:14" -> (known after apply)
        # (15 unchanged attributes hidden)






        # (7 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.neo4j must be replaced
-/+ resource "aws_ecs_task_definition" "neo4j" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:14" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "NEO4J_ACCEPT_LICENSE_AGREEMENT"
                          - value = "yes"
                        },
                      - {
                          - name  = "NEO4J_dbms.memory.heap.initial_size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_dbms_memory_heap_max__size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_dbms_memory_pagecache_size"
                          - value = "4G"
                        },
                    ]
                  - essential        = true
                  - image            = "neo4j:4.4.10@sha256:8e3dabe4b3d21c3ffa94dac6750c748b29f93b38d24182c3609ee0cbf293d4cf"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/neo4j"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "neo4j-task"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/var/lib/neo4j/data"
                          - readOnly      = false
                          - sourceVolume  = "neo4j-efs-volume"
                        },
                    ]
                  - name             = "neo4j"
                  - portMappings     = [
                      - {
                          - containerPort = 7474
                          - hostPort      = 7474
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 7473
                          - hostPort      = 7473
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 7687
                          - hostPort      = 7687
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEO4J_AUTH"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 400000
                          - name      = "nofile"
                          - softLimit = 400000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "neo4j" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - volume {
          - name = "neo4j-efs-volume" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-00eb8b7a5c27bea14" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null
            }
        }
      + volume {
          + name = "neo4j-efs-volume"

          + efs_volume_configuration {
              + file_system_id     = "fs-00eb8b7a5c27bea14"
              + root_directory     = "/"
              + transit_encryption = "ENABLED"
            }
        }
    }

  # aws_iam_policy.cartography_policies will be updated in-place
  ~ resource "aws_iam_policy" "cartography_policies" {
        id        = "arn:aws:iam::794722365809:policy/CartographyContainerExecutionPolicies"
        name      = "CartographyContainerExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::957818836222:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::946524763117:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::886481071419:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::871282759583:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::866996500832:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::862524432354:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::847097524271:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::843973686572:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806721586252:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806545929748:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::796730610681:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::794722365809:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::774443804833:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::773858180673:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::762579868088:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::729164266357:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::692499439251:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::687401027353:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::659087519042:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::639515743091:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::637287734259:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::571510889204:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::563894450011:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::507252742351:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::493890668711:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472286471787:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472285538301:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::419291849580:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::414662622316:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::373750682134:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::339850311124:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::296255494825:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::283582579564:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::276192857112:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::274536870005:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::239043911459:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::236007890657:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::226270273618:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::154232573588:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::137554749751:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::132761243856:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::131154131660:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::127893201980:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::124044056575:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::067823670710:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::034163289675:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::026142063939:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::017790921725:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::009883649233:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::008792007042:role/secopsAssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:Describe*"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/shared_key",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/customer_id",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.asset_inventory_cloudquery will be created
  + resource "aws_sfn_state_machine" "asset_inventory_cloudquery" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = <<-EOT
            {
              "Comment": "Run daily asset inventory of cloud assets",
              "TimeoutSeconds": 86400,
              "StartAt": "CloudQuery",
              "States": {
                "CloudQuery": {
                  "Type": "Task",
                  "Resource": "arn:aws:states:::ecs:runTask.sync",
                  "Parameters": {
                    "Cluster": "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery",
                    "LaunchType": "FARGATE",
                    "TaskDefinition": "arn:aws:ecs:ca-central-1:794722365809:task-definition/cloudquery:3",
                    "Overrides": {
                      "ContainerOverrides": [
                        {
                          "Name": "cloudquery",
                          "Environment": [
                            {
                              "Name": "CQ_S3_BUCKET",
                              "Value": "security-tools-794722365809-cloudquery-results"
                            }
                          ]
                        }
                      ]
                    },
                    "NetworkConfiguration": {
                      "AwsvpcConfiguration": {
                        "SecurityGroups": ["sg-03caf974f268a3efb"],
                        "Subnets": [""subnet-08cab5daf34489c53", "subnet-07f8e17bbf11b0797", "subnet-0d92713028fd15243""]
                      }
                    }
                  },
                  "Retry": [
                    {
                      "ErrorEquals": [
                        "ECS.AmazonECSException"
                      ],
                      "IntervalSeconds": 300,
                      "MaxAttempts": 4,
                      "BackoffRate": 2
                    }
                  ],
                  "Catch": [
                    {
                      "ErrorEquals": [
                        "States.ALL"
                      ],
                      "ResultPath": null,
                      "Next": "Handle Failure"
                    }
                  ],
                  "End": true
                },
                "Handle Failure": {
                  "Type": "Pass",
                  "End": true
                }
              }
            }
        EOT
      + id            = (known after apply)
      + name          = "asset-inventory-cloudquery"
      + name_prefix   = (known after apply)
      + role_arn      = "arn:aws:iam::794722365809:role/secopsAssetInventoryStateMachineRole"
      + status        = (known after apply)
      + tags          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

  # aws_ssm_parameter.neo4j_auth will be updated in-place
  ~ resource "aws_ssm_parameter" "neo4j_auth" {
        id              = "/cartography/neo4j_auth"
      + insecure_value  = (known after apply)
        name            = "/cartography/neo4j_auth"
        tags            = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 3 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.cloudquery_s3_bucket.aws_s3_bucket.this,
  on .terraform/modules/cloudquery_s3_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.list_accounts_in_org"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
